src/InformationRegisters/ОтветыКоманд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОтветыКоманд</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Квизы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раунд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Раунды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтветНаВопрос</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОтветыКоманд/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗафиксироватьОтветыКоманды(ОтветыНаВопросы) Экспорт
	
	Для Каждого Ответ Из ОтветыНаВопросы Цикл
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Ответ);
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

Функция НовыйТаблицаОтвета() Экспорт
	
	Результат = Новый ТаблицаЗначений;
	КЧ = Новый КвалификаторыЧисла(10);
	КС = Новый КвалификаторыСтроки(150);

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Число"));
	МассивТипов.Добавить(Тип("Строка"));
	
	ОписаниеТиповОтвет = Новый ОписаниеТипов(МассивТипов, , КС, КЧ);
	
	Результат.Колонки.Добавить("Квиз", Новый ОписаниеТипов("СправочникСсылка.Квизы"));
	Результат.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка.Команды"));
	Результат.Колонки.Добавить("Раунд", Новый ОписаниеТипов("СправочникСсылка.Раунды"));
	Результат.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.Вопросы"));
	Результат.Колонки.Добавить("Ответ", ОписаниеТиповОтвет);
	
	Возврат Результат;
	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
